def main():
    x = float(input("Введіть координату x для точки А: "))
    y = float(input("Введіть координату y для точки А: "))
    if x == 0 and y == 0:
        print("Точка А знаходиться в початку координат.")
    elif x == 0:
        print("Точка А знаходиться на осі Y.")
    elif y == 0:
        print("Точка А знаходиться на осі X.")
    elif x > 0 and y > 0:
        print("Точка А знаходиться в першому квадранті.")
    elif x < 0 and y > 0:
        print("Точка А знаходиться в другому квадранті.")
    elif x < 0 and y < 0:
        print("Точка А знаходиться в третьому квадранті.")
    elif x > 0 and y < 0:
        print("Точка А знаходиться в четвертому квадранті.")
if __name__ == "__main__":
    main()
